---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType
source: html/49620efb-cc13-70af-af38-c8e823d4ee2a.htm
---
# Autodesk.Revit.DB.IFC.IFCProjectLevelGUIDType

The type of the GUID to be retrieved from Revit.

## Syntax (C#)
```csharp
public enum IFCProjectLevelGUIDType
```